/*
 * _______________#########_______________________
 * ______________############_____________________
 * ______________#############____________________
 * _____________##__###########___________________
 * ____________###__######_#####__________________
 * ____________###_#######___####_________________
 * ___________###__##########_####________________
 * __________####__###########_####_______________
 * ________#####___###########__#####_____________
 * _______######___###_########___#####___________
 * _______#####___###___########___######_________
 * ______######___###__###########___######_______
 * _____######___####_##############__######______
 * ____#######__#####################_#######_____
 * ____#######__##############################____
 * ___#######__######_#################_#######___
 * ___#######__######_######_#########___######___
 * ___#######____##__######___######_____######___
 * ___#######________######____#####_____#####____
 * ____######________#####_____#####_____####_____
 * _____#####________####______#####_____###______
 * ______#####______;###________###______#________
 * ________##_______####________####______________
 *
 * @Descripttion:
 * @version:
 * @Date: 2021-07-23 16:10:49
 * @LastEditors: huzhushan@126.com
 * @LastEditTime: 2022-09-27 15:47:50
 * @Author: huzhushan@126.com
 * @HomePage: https://huzhushan.gitee.io/vue3-element-admin
 * @Github: https://github.com/huzhushan/vue3-element-admin
 * @Donate: https://huzhushan.gitee.io/vue3-element-admin/donate/
 */
import { defineStore } from 'pinia'

const useStore = defineStore('store', {
  state: () => ({
    supplier: {
      id: -1,
      name: '无数据',
      code: 'supplier-abc',
      supOrgid: 's-abc',
    },
    productionLine: {
      id: -1,
      name: '无数据',
      code: '无数据',
      imagePath: '无数据',
      imageHeight: 999,
      imageWidth: 999,
    },
    equipment: {
      id: -1,
      name: '无数据',
      code: '无数据',
      imagePath: '无数据',
      imageHeight: 999,
      imageWidth: 999,
      productionLineCode: '无数据',
      productionLineName: '无数据',
    },
    sensor: {
      id: -1,
      code: '无数据',
    },
    tabSelected: {
      productionLineTab: 'first',
      equipmentTab: 'first',
    },
  }),
  // persist: true,
  persist: {
    storage: sessionStorage, // 存到sessionStorage
  },
})

export default useStore
